code/openfoam/tutorials/incompressibleFluid/elipsekkLOmega/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication transformPoints "scale=(1.6666 1 1)"

runApplication mirrorMesh -dict mirrorMeshDict.x
rm log.mirrorMesh
runApplication mirrorMesh -dict mirrorMeshDict.y

runApplication createPatch
runApplication foamRun

#------------------------------------------------------------------------------
